In [1]:
import pandas as pd
import os

columns = ['City', 'Big Data Job Offers', 'Data Science Job Offers', 'Machine Learning Job Offers']
cities = {}

In [2]:
def count():
    f = open("total.csv", 'r')
    for line in f:
        data = line.strip().split(",")
        city = data[0]
        job_offer = data[1]
        total_count = int(data[2])
        if city not in cities:
            cities[city] = {}
        cities[city][job_offer] = total_count

In [3]:
count()

In [4]:
cities

{'Amsterdam': {'Big Data': 1291,
  'Data Science': 1211,
  'Machine Learning': 494},
 'Barcelona': {'Big Data': 417, 'Data Science': 334, 'Machine Learning': 158},
 'Berlin': {'Big Data': 1022, 'Data Science': 982, 'Machine Learning': 688},
 'Bogota': {'Big Data': 41, 'Data Science': 51, 'Machine Learning': 11},
 'Boston': {'Big Data': 2234, 'Data Science': 6702, 'Machine Learning': 1271},
 'Buenos Aires': {'Big Data': 172,
  'Data Science': 167,
  'Machine Learning': 178},
 'Lima': {'Big Data': 25, 'Data Science': 19, 'Machine Learning': 20},
 'Lisboa': {'Big Data': 252, 'Data Science': 294, 'Machine Learning': 132},
 'London': {'Big Data': 4981, 'Data Science': 5395, 'Machine Learning': 2689},
 'Madrid': {'Big Data': 528, 'Data Science': 382, 'Machine Learning': 165},
 'Mexico City': {'Big Data': 195, 'Data Science': 226, 'Machine Learning': 60},
 'New York': {'Big Data': 5397,
  'Data Science': 10074,
  'Machine Learning': 2196},
 'Paris': {'Big Data': 3707, 'Data Science': 1835, 'Machine Learning': 1292},
 'San Francisco': {'Big Data': 3867,
  'Data Science': 7657,
  'Machine Learning': 2314},
 'Santiago': {'Big Data': 102, 'Data Science': 61, 'Machine Learning': 49},
 'Sao Paulo': {'Big Data': 274, 'Data Science': 295, 'Machine Learning': 112}}

In [5]:
def addRow(df, dic):
    for k, v in dic.items():
        df2 = pd.DataFrame(data=[[k, v['Big Data'], v['Data Science'], v['Machine Learning']]], columns=columns)
        df = df.append(df2)
    df.index = [i for i in range(len(dic))]
    return df

In [6]:
maindf = pd.DataFrame(columns=columns)

In [7]:
maindf = addRow(maindf, cities)

In [10]:
maindf

,City,Big Data Job Offers,Data Science Job Offers,Machine Learning Job Offers,Total New Tech Job Offers
0,Amsterdam,1291,1211,494,2996
1,Barcelona,417,334,158,909
2,Berlin,1022,982,688,2692
3,Bogota,41,51,11,103
4,Boston,2234,6702,1271,10207
5,Buenos Aires,172,167,178,517
6,Lima,25,19,20,64
7,Lisboa,252,294,132,678
8,London,4981,5395,2689,13065
9,Madrid,528,382,165,1075
10,Mexico City,195,226,60,481
11,New York,5397,10074,2196,17667
12,Paris,3707,1835,1292,6834
13,San Francisco,3867,7657,2314,13838
14,Santiago,102,61,49,212
15,Sao Paulo,274,295,112,681

In [9]:
maindf['Total New Tech Job Offers'] = maindf.apply(lambda x: x[columns[1]] + x[columns[2]] + x[columns[3]], axis=1)